<?php

class GustavoTranslations {
	private $translations = [
		"global" => [
			"total" => [
				"ru-RU" => 'Всего',
				"uk" => 'Всього'
			],
			"count_full" => [
				"ru-RU" => 'Количество',
				"uk" => 'Кіл-ть'
			],
			"count_mobile" => [
				"ru-RU" => 'Кол-во',
				"uk" => 'Кіл-ть'
			],
			"count" => [
				"ru-RU" => 'Кол-во шт.',
				"uk" => 'Кіл-ть шт.'
			],
			"price" => [
				"ru-RU" => 'Цена',
				"uk" => 'Ціна'
			],
			"workTime" => [
				"ru-RU" => 'График работы',
				"uk" => 'Графік роботи'
			],
			"paymentDescription" => [
				"ru-RU" => 'Оплата при доставке наличными или картами банка Visa и Mastercard',
				"uk" => 'Оплата при доставці готівкою або картками банку Visa і Mastercard'
			],
			"deliveryRegion" => [
				"ru-RU" => 'Регион доставки',
				"uk" => 'Регіон доставки'
			],
			"deliveryUrl" => [
				"ru-RU" => '/ru/payment-ru',
				"uk" => '/payment'
			],
			"city" => [
				"ru-RU" => 'г. Черновцы',
				"uk" => 'м. Чернівці'
			],
			"actionsUrl" => [
				"ru-RU" => '/ru/akcii-ru',
				"uk" => '/akcii'
			],
			"promo" => [
				"ru-RU" => 'Выберите промокод',
				"uk" => 'Вибрати промокод'
			],
			"meta_description" => [
				"ru-RU" => 'Бесплатная доставка пиццы, суши, салатов и напитков по Черновцам из ресторана «Дон Густаво»',
				"uk" => 'Безкоштовна доставка піци, суші і напоїв у Чернівцях з ресторану Дон Густаво'
			],
			"details" => [
				"ru-RU" => 'Подробнее',
				"uk" => 'Детальніше'
			]
		],
		"header" => [],
		"footer" => [
			"contacts" => [
				"ru-RU" => "Контакты",
				"uk" => "Контакти"
			],
			"payment_title" => [
				"ru-RU" => "Способы оплаты:",
				"uk" => "Способи оплати"
			],
			"site_map" => [
				"ru-RU" => "Карта сайта",
				"uk" => "Карта сайту"
			],
			"payment" => [
				"ru-RU" => "Оплата при доставке наличными <br> или картами банка Visa и Mastercard",
				"uk" => "Оплата при доставці готівкою <br> або картами банку Visa і Mastercard"
			],
			"app" => [
				"ru-RU" => "Скачивайте мобильное приложение для заказа онлайн:",
				"uk" => "Завантажуйте мобільний додаток для замовлення онлайн:"
			],
			"politics" => [
				"ru-RU" => "Политика конфиденциальности",
				"uk" => "Політика конфеденційності"
			],
			"rights" => [
				"ru-RU" => "Все права защищены",
				"uk" => "Всі права захищено"
			],
			"development" => [
				"ru-RU" => "Проект <br> разработан:",
				"uk" => "Проект <br> розроблено:"
			],
		],
		"plp" => [
			"pizza" => [
				"title" => [
					"ru-RU" => 'Выбирайте из более %count% вида пицц <br> с возможностью компоновки ингредиентов',
					"uk" => 'Вибирайте з більш ніж %count% видів піц <br> з можливістю додавання інгридієнтів'
				],
				"weight" => [
					"ru-RU" => 'Вес',
					"uk" => 'Вага'
				],
				"add_components" => [
					"ru-RU" => 'Добавить компоненты',
					"uk" => 'Додати складові'
				],
				"related" => [
					"ru-RU" => 'С пиццей чаще всего заказывают:',
					"uk" => 'З піцею найчастіше замовляють:'
				]
			],
			"sushi" => [
				"title" => [
					"ru-RU" => 'Выбирайте из более %count% видов роллов и сетов в нашем ассортименте',
					"uk" => 'Обирайте з більше ніж %count% видів ролів і сетів з нашого асортименту'
				],
				"related" => [
					"ru-RU" => 'С роллами и сетами чаще всего заказывают:',
					"uk" => 'З ролами і сетами найчастіше замовляють:'
				],
				'seoText' => [
					"ru-RU" => '<div class="container">
									<h1 class="section_title section_title--white">Бесплатная доставка суш в Черновцах из ресторана Дон Густаво</h1>
									<p>Поесть суши в Черновцах можно не выходя из дома с доставкой суши от ресторана Дон Густаво.</p>
									<p>А какие ваши любимые роллы? С филадельфией? С лососем? Или может быть запеченные? У нас вы сможете найти самые изысканные роллы и суши на любой вкус.</p>
									<p>Наши повара начинают готовить заказанные вами роллы и суши только после того, как операторы примут заказ и уточнят все нюансы заказа. Поэтому все наши клиенты могут быть уверенные в свежести и качестве своего заказа.</p>
									<p>Заказывайте суши в Черновцах у нас под любое событие: день рождение, корпоратив, романтический ужин или просто насладится любимой едой.</p>
								</div>',
					"uk" => '<div class="container">
									<h1 class="section_title section_title--white">Безкоштовна доставка суші в Чернівцях з ресторану Дон Густаво</h1>
									<p>Поїсти суші в Чернівцях можна не виходячи з дому з доставкою суші від ресторану Дон Густаво.</p>
									<p>А які ваші улюблені роли? З Філадельфією? З лососем? Або може бути запечені? У нас ви зможете знайти найвишуканіші роли і суші на будь-який смак.</p>
									<p>Наші кухарі починають готувати замовлені вами роли і суші тільки після того, як оператори приймуть замовлення і уточнять всі нюанси замовлення. Тому всі наші клієнти можуть бути впевнені в свіжості і якості свого замовлення.</p>
									<p>Замовляйте суші в Чернівцях у нас під будь-яку подію: день народження, корпоратив, романтичну вечерю або просто насолодитися улюбленою їжею.</p>
								</div>'
				]

			],
			"drinks" => [
				"title" => [
					"ru-RU" => 'Выберите напиток, который идеально подойдет для пиццы и роллов',
					"uk" => 'Виберіть напій, який ідеально підійде для піци та ролів'
				]
			]
		],
		"pdp" => [
			'additives_title' => [
				"ru-RU" => 'Более %count% видов добавок к пицце в ассортименте',
				"uk" => 'Більше ніж %count% видів додатків до піци в асортименті'
			],
			'additives_added' => [
				"ru-RU" => 'Добавленно',
				"uk" => 'Додано'
			],
			"addAdditions" => [
				"ru-RU" => 'Добавить <br> составляющие',
				"uk" => 'Додати <br> складові'
			],
			"additives" => [
				"ru-RU" => 'Дополнений  <br> к пицце:',
				"uk" => 'Доповнення <br> до піци:'
			]
		],
		"cart" => [
			"title" => [
				"ru-RU" => 'Оформление заказа',
				"uk" => 'Оформлення замовлення'
			],
			"subtitle" => [
				"ru-RU" => 'Заполните данные и укажите адрес доставки:',
				"uk" => 'Заповніть данні та вкажіть адресу доставки'
			],
			"order" => [
				"ru-RU" => 'Ваш заказ',
				"uk" => 'Ваше замовлення'
			],
			"button" => [
				"ru-RU" => 'Оформить заказ',
				"uk" => 'Оформити замовлення'
			],
			"order_description" => [
				"ru-RU" => '+ возможна платная доставка за пределами зоны',
				"uk" => '+ можлива платна доставка за межами зони'
			],
			"fields" => [
				"name" => [
					"ru-RU" => 'Ваше имя',
					"uk" => 'Ваше ім’я'
				],
				"phone" => [
					"ru-RU" => 'Ваш телефон',
					"uk" => 'Ваш телефон'
				],
				"comment" => [
					"ru-RU" => 'Ваш возможный комментарий',
					"uk" => 'Ваш можливий коментар'
				],
				"d_address" => [
					"ru-RU" => 'Доставка по адресу',
					"uk" => 'Доставка за адресою'
				],
				"street" => [
					"ru-RU" => 'Улица',
					"uk" => 'Вулиця'
				],
				"house" => [
					"ru-RU" => 'Номер дома',
					"uk" => 'Номер будинку'
				],
				"entrance" => [
					"ru-RU" => 'Подъезд',
					"uk" => 'Підїзд'
				],
				"apartment" => [
					"ru-RU" => 'Квартира',
					"uk" => 'Квартира'
				],
				"selfdelivery" => [
					"ru-RU" => 'Самовывоз',
					"uk" => 'Самовивіз'
				],
				"payment_n" => [
					"ru-RU" => 'Оплата наличными',
					"uk" => 'Оплата готівкою'
				],
				"payment_c" => [
					"ru-RU" => 'Безналичная оплата',
					"uk" => 'Безгот. розрахунок'
				],
//				"name" => [
//					"ru-RU" => 'Добавить компоненты',
//					"uk" => 'Вибрати додатки'
//				],
//				"name" => [
//					"ru-RU" => 'Добавить компоненты',
//					"uk" => 'Вибрати додатки'
//				],
			]
		],
		"responses" => [
			"title" => [
				"ru-RU" => 'Отзывы наших клиентов',
				"uk" => 'Відгуки наших клієнтів'
			]
		]
	];
	public $currentLang = null;

	public function __construct() {
		$langs = pll_the_languages( array( 'raw' => 1 ) );
		if(!empty($langs) and is_array($langs)) {
			foreach($langs as $l) {
				if($l['current_lang']) {
					$this->currentLang = $l['locale'];
				}
			}
		} else {
			$this->currentLang = 'ua';
		}


	}

	public function getTranslation($type=array(), $arg=array()) {
		$template = null;
		$re = '/-ru$/s';

		foreach($type as $key=>$t) {

			if($key === 0) {
				$template = $this->translations[$t];
			} else {
				$part = preg_replace($re, '', $t);

				$template = (!empty($template)) ? $template[$part] : null;

			}

		}

		$template = (!empty($template)) ? $template[$this->currentLang] : null;
		return preg_replace_callback('/%(\w+)%/m', function($matches) use ($arg) {
			return $arg[$matches[1]];
		}, $template);
	}


}