<?php

class GustavoTranslations {
	private $translations = [
		"global" => [
			"total" => [
				"ru_RU" => 'Всего',
				"uk" => 'Всього'
			],
			"count_full" => [
				"ru_RU" => 'Количество',
				"uk" => 'Кілсть'
			],
			"count_mobile" => [
				"ru_RU" => 'Кол-во',
				"uk" => 'Кіл-ть'
			],
			"count" => [
				"ru_RU" => 'Кол-во шт.',
				"uk" => 'Кіл-сть шт.'
			],
			"price" => [
				"ru_RU" => 'Цена',
				"uk" => 'Ціна'
			],
			"promo" => [
				"ru_RU" => 'Выберите промокод',
				"uk" => 'Виберіть промокод'
			]
		],
		"header" => [],
		"footer" => [
			"contacts" => [
				"ru_RU" => "Контакты",
				"uk" => "Контакти"
			],
			"payment_title" => [
				"ru_RU" => "Способы оплаты:",
				"uk" => "Способи оплати"
			],
			"site_map" => [
				"ru_RU" => "Карта сайта",
				"uk" => "Мапа сайту"
			],
			"payment" => [
				"ru_RU" => "Оплата при доставке наличными <br> или картами банка Visa и Mastercard",
				"uk" => "Оплата "
			],
			"app" => [
				"ru_RU" => "Скачивайте мобильное приложение для заказа онлайн:",
				"uk" => "Качайте мобільний додаток для замовлення онлайн:"
			],
			"politics" => [
				"ru_RU" => "Политика конфиденциальности",
				"uk" => "Політика конфеденційності"
			],
			"rights" => [
				"ru_RU" => "Все права защищены",
				"uk" => "Всі права захищено"
			],
			"development" => [
				"ru_RU" => "Проект <br> разработан:",
				"uk" => ""
			],
		],
		"plp" => [
			"pizza" => [
				"title" => [
					"ru_RU" => 'Выбирайте из более %count% вида пицц <br> с возможностью компоновки ингредиентов',
					"uk" => 'Вибирайте з більш ніж %count% видів піц <br> з можливістю додавання інгридієнтів'
				],
				"weight" => [
					"ru_RU" => 'Вес',
					"uk" => 'Вага'
				],
				"add_components" => [
					"ru_RU" => 'Добавить компоненты',
					"uk" => 'Вибрати додатки'
				],
				"related" => [
					"ru_RU" => 'С пиццей чаще всего заказывают:',
					"uk" => 'З піцею найчастіше замовляють:'
				]
			],
			"sushi" => [
				"title" => [
					"ru_RU" => 'Выбирайте из более %count% видов роллов и сетов в нашем ассортименте',
					"uk" => 'Вибирайте з більш ніж %count% видів ролів та сетів в нашому асортименті'
				],
				"related" => [
					"ru_RU" => 'С суши чаще всего заказывают:',
					"uk" => 'З суші найчастіше замовляють:'
				]

			],
			"drinks" => [
				"title" => [
					"ru_RU" => 'Выберите напиток, который идеально подойдет для пиццы и роллов',
					"uk" => 'Виберіть напій, який ідеально підійде для піци та ролів'
				]
			]
		],
		"pdp" => [
			'additives_title' => [
				"ru_RU" => 'Более %count% видов добавок к пицце в ассортименте',
				"uk" => 'Більше ніж %count% видів додатків до піци в асортименті'
			],
			'additives_added' => [
				"ru_RU" => 'Добавленно',
				"uk" => 'Додано'
			],
			"addAdditions" => [
				"ru_RU" => 'Добавить <br> составляющие',
				"uk" => 'Додати <br> додатки'
			],
			"additives" => [
				"ru_RU" => 'Дополнений  <br> к пицце:',
				"uk" => 'Додатків <br> до піци:'
			]
		],
		"cart" => [
			"title" => [
				"ru_RU" => 'Оформление заказа',
				"uk" => 'Оформлення замовлення'
			],
			"subtitle" => [
				"ru_RU" => 'Заполните данные и укажите адрес доставки:',
				"uk" => 'Заповніть данні та вкажіть адресу доставки'
			],
			"order" => [
				"ru_RU" => 'Ваш заказ',
				"uk" => 'Ваше замовлення'
			],
			"button" => [
				"ru_RU" => 'Оформить заказ',
				"uk" => 'Оформити замовлення'
			],
			"order_description" => [
				"ru_RU" => '+ возможна платная доставка за пределами зоны',
				"uk" => '+ можлива платна доставка за межами зони'
			],
			"fields" => [
				"name" => [
					"ru_RU" => 'Ваше имя',
					"uk" => 'Ваше ім’я'
				],
				"phone" => [
					"ru_RU" => 'Ваш телефон',
					"uk" => 'Ваш телефон'
				],
				"comment" => [
					"ru_RU" => 'Ваш возможный комментарий',
					"uk" => 'Ваш можливий коментар'
				],
				"d_address" => [
					"ru_RU" => 'Доставка по адресу',
					"uk" => 'Доставка за адресою'
				],
				"street" => [
					"ru_RU" => 'Улица',
					"uk" => 'Вибрати додатки'
				],
				"house" => [
					"ru_RU" => 'Номер дома',
					"uk" => 'Вибрати додатки'
				],
				"entrance" => [
					"ru_RU" => 'Подъезд',
					"uk" => 'Підїзд'
				],
				"apartment" => [
					"ru_RU" => 'Квартира',
					"uk" => 'Квартира'
				],
				"selfdelivery" => [
					"ru_RU" => 'Самовывоз',
					"uk" => 'Самовивіз'
				],
				"payment_n" => [
					"ru_RU" => 'Оплата наличными',
					"uk" => 'Оплата готівкою'
				],
				"payment_c" => [
					"ru_RU" => 'Безналичная оплата',
					"uk" => 'Безготівковий розрахунок'
				],
//				"name" => [
//					"ru_RU" => 'Добавить компоненты',
//					"uk" => 'Вибрати додатки'
//				],
//				"name" => [
//					"ru_RU" => 'Добавить компоненты',
//					"uk" => 'Вибрати додатки'
//				],
			]
		]
	];
	private $currentLang = null;

	public function __construct() {
		$langs = pll_the_languages( array( 'raw' => 1 ) );
		foreach($langs as $l) {
			if($l['current_lang']) {
				$this->currentLang = $l['locale'];
			}
		}
	}

	public function getTranslation($type=array(), $arg=array()) {
		$template = null;
		$re = '/-ru$/s';
		foreach($type as $key=>$t) {

			if($key === 0) {
				$template = $this->translations[$t];
			} else {
				$part = preg_replace($re, '', $t);
				$template = (!empty($template)) ? $template[$part] : null;
			}
		}

		$template = (!empty($template)) ? $template[$this->currentLang] : null;

		return preg_replace_callback('/%(\w+)%/m', function($matches) use ($arg) {
			return $arg[$matches[1]];
		}, $template);
	}


}